[
    {
        "title": "VENISON FAJITAS",
        "link": "https://www.tasteofhome.com/recipes/venison-fajitas/",
        "Ingredients": [
            "1/2 cup orange juice",
            "1/4 cup white vinegar",
            "1 tablespoon seasoned salt",
            "1/4 teaspoon pepper",
            "1/4 teaspoon cayenne pepper",
            "1-1/2 pounds venison or elk flank steak, cut into thin strips",
            "1 medium green pepper, julienned",
            "1 medium sweet red pepper, julienned",
            "1 medium onion, halved and sliced",
            "2 tablespoons vegetable oil, divided",
            "8 flour tortillas (8 inches)",
            "2 cups shredded Mexican cheese blend or cheddar cheese",
            "Sour cream and salsa"
        ],
        "Directions": [
            "In a large resealable plastic bag, combine the first five ingredients. Add meat. Seal bag and turn to coat; refrigerate for 2 hours. Drain and discard marinade. In a large skillet, saute peppers and onion in 1 tablespoon oil until crisp-tender; remove and set aside. Heat remaining oil; stir-fry meat for 3-5 minutes or until no longer pink. Return vegetables to pan; heat through. Spoon over tortillas; top with cheese, sour cream and salsa; fold in sides."
        ],
        "nutrition_facts": null
    },
    {
        "title": "ALL DAY VENISON POT ROAST",
        "link": "https://www.allrecipes.com",
        "Ingredients": [
            "8 h 15 m, 6 servings, 343 cals",
            "3 onions, chopped",
            "5 carrots, cut into 2-inch pieces",
            "1 cup chopped portobello mushrooms",
            "3 pounds venison rump roast",
            "2 garlic cloves, crushed",
            "1 tablespoon ground black pepper",
            "salt to taste (optional) ",
            "1 (10.75 ounce) can condensed cream of mushroom soup",
            "1 (10.5 ounce) can condensed beef broth",
            "1/4 cup water",
            "1 (1.25 ounce) envelope dry onion gravy mix",
            "Add all ingredients to list"
        ],
        "Directions": [
            "Prep 15 m",
            "Cook 8 h",
            "Ready In 8 h 15 m",
            "Arrange the onions, carrots, and mushrooms in the bottom of a slow cooker. Rub the venison rump roast with garlic, black pepper, and salt, then place on top of the vegetables. Mix the cream of mushroom soup, beef broth, water, and onion gravy mix in a bowl until gravy mix is dissolved; pour soup mixture over the roast.",
            "Cook on High setting until roast is very tender, 8 to 10 hours. Slice roast before serving with gravy and vegetables."
        ],
        "nutrition_facts": [
            "Per Serving: 343 calories; 7.9 g fat; 19.6 g carbohydrates; 47 g protein; 161 mg cholesterol; 1043 mg sodium. Full nutrition"
        ]
    },
    {
        "title": "​VENISON STEAK WITH WILD RICE PILAF",
        "link": "​https://honest-food.net/venison-steak-recipe-wild-rice/",
        "Ingredients": [
            "1 1/2 pounds venison steaks",
            "Salt",
            "1 cup wild rice",
            "3 cups venison or beef stock",
            "1/2 pound mushrooms (maitake, hen of the woods if you can find them)",
            "6 tablespoons unsalted butter, divided",
            "1 onion, chopped",
            "1/4 cup chopped hazelnuts​  ",
            "1 cup cranberries or 1/4 cup craisins",
            "1 fuyu persimmon, peeled and dived (optional)",
            "1/4 cup chopped parsley",
            "Black pepper",
            "Squash seed oil, for finishing (optional)"
        ],
        "Directions": [
            "Take the venison out of the fridge and salt it well. Let it sit on the cutting board while you make the rice and such.",
            "Cook the wild rice in the beef broth. You might need to add a cup of water or so, depending on how old your rice it. Also, real, traditional wild rice cooks in half the time as typical store-bought, and it requires less water. If you have the real stuff, use 2 cups broth and 1 cup water. Cook the rice until tender and drain.",
            "Put the mushrooms in a large frying pan or saute pan and turn the heat to high. Dry saute the mushrooms, shaking them frequently, until they sizzle and begin to give up their water. When they do, boil off this water. When it's almost gone, add 2 tablespoons of the butter and saute until the mushrooms begin to brown. Salt them as they cook. Remove and set aside.",
            "Add the chopped onions to the pan as well as another 2 tablespoons of butter. Saute on medium-high heat until browned on the edges, about 6 to 8 minutes. Remove the onions and put them with the mushrooms.",
            "Add the remaining 2 tablespoons of butter to the pan. Dry the venison with paper towels and add it to the pan. Sear the venison medium-rare. How long this will take depends on how thick the venison is. Use the finger test for doneness to determine how done you want your meat. Take the meat out and let it rest.",
            "Turn the heat to medium-low and add back the mushrooms and onions to the pan. Add the remaining ingredients except for the squash seed oil (if using) and toss to combine. Heat this just until everything is warm, then divide it onto people's plates. Grind some black pepper over everything. Slice the venison thickly and serve, drizzled with the squash seed oil."
        ],
        "nutrition_facts": null
    }
]